<!-- terragrunt-results -->
## Terraform Plan

**Plan Summary:** 103 to add, 0 to change, 0 to destroy

<details><summary>View full plan</summary>

```
[0;90m19:01:03.757[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0mOpenTofu used the selected providers to generate the following execution
[0;90m19:01:03.757[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0mplan. Resource actions are indicated with the following symbols:
[0;90m19:01:03.757[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m  + create
[0;90m19:01:03.757[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0mOpenTofu will perform the following actions:
[0;90m19:01:03.757[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m  # aws_kms_alias.this[0] will be created
[0;90m19:01:03.757[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m  + resource "aws_kms_alias" "this" {
[0;90m19:01:03.757[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + arn            = (known after apply)
[0;90m19:01:03.757[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + id             = (known after apply)
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + name           = "alias/production-us-east-1-infra"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + name_prefix    = (known after apply)
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + target_key_arn = (known after apply)
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + target_key_id  = (known after apply)
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m  # aws_kms_key.this will be created
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m  + resource "aws_kms_key" "this" {
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + arn                                = (known after apply)
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + bypass_policy_lockout_safety_check = false
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + deletion_window_in_days            = 30
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + description                        = "production infrastructure encryption key for EKS, Aurora, and EBS"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + enable_key_rotation                = true
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + id                                 = (known after apply)
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + is_enabled                         = true
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + key_id                             = (known after apply)
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + key_usage                          = "ENCRYPT_DECRYPT"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + multi_region                       = (known after apply)
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + policy                             = (known after apply)
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + rotation_period_in_days            = (known after apply)
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + tags                               = {
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m          + "Component"   = "kms"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m      + tags_all                           = {
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m          + "Component"   = "kms"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0mPlan: 2 to add, 0 to change, 0 to destroy.
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0mChanges to Outputs:
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m  + alias_arn  = (known after apply)
[0;90m19:01:03.758[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m  + alias_name = "alias/production-us-east-1-infra"
[0;90m19:01:03.759[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m  + key_arn    = (known after apply)
[0;90m19:01:03.759[0m [0;37mSTDOUT[0m [0;38;5;67m[us-east-1/kms] [0m[0;36mtofu: [0m  + key_id     = (known after apply)
Running Trivy config scan...
[0;90m19:01:03.869[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0mOpenTofu used the selected providers to generate the following execution
[0;90m19:01:03.869[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0mplan. Resource actions are indicated with the following symbols:
[0;90m19:01:03.869[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + create
[0;90m19:01:03.869[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0mOpenTofu will perform the following actions:
[0;90m19:01:03.869[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_eip.nat[0] will be created
[0;90m19:01:03.869[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_eip" "nat" {
[0;90m19:01:03.869[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + allocation_id        = (known after apply)
[0;90m19:01:03.869[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn                  = (known after apply)
[0;90m19:01:03.869[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + association_id       = (known after apply)
[0;90m19:01:03.869[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + carrier_ip           = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + customer_owned_ip    = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + domain               = "vpc"
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                   = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + instance             = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipam_pool_id         = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + network_border_group = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + network_interface    = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + private_dns          = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + private_ip           = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ptr_record           = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + public_dns           = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + public_ip            = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + public_ipv4_pool     = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags                 = {
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-nat-eip-1"
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all             = {
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-nat-eip-1"
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc                  = (known after apply)
[0;90m19:01:03.870[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_eip.nat[1] will be created
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_eip" "nat" {
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + allocation_id        = (known after apply)
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn                  = (known after apply)
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + association_id       = (known after apply)
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + carrier_ip           = (known after apply)
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + customer_owned_ip    = (known after apply)
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + domain               = "vpc"
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                   = (known after apply)
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + instance             = (known after apply)
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipam_pool_id         = (known after apply)
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + network_border_group = (known after apply)
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + network_interface    = (known after apply)
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + private_dns          = (known after apply)
[0;90m19:01:03.871[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + private_ip           = (known after apply)
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ptr_record           = (known after apply)
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + public_dns           = (known after apply)
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + public_ip            = (known after apply)
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + public_ipv4_pool     = (known after apply)
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags                 = {
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-nat-eip-2"
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all             = {
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-nat-eip-2"
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.872[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc                  = (known after apply)
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_internet_gateway.main will be created
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_internet_gateway" "main" {
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn      = (known after apply)
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id       = (known after apply)
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + owner_id = (known after apply)
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags     = {
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-igw"
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all = {
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.873[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-igw"
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc_id   = (known after apply)
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_nat_gateway.main[0] will be created
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_nat_gateway" "main" {
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + allocation_id                      = (known after apply)
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + association_id                     = (known after apply)
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + connectivity_type                  = "public"
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                                 = (known after apply)
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + network_interface_id               = (known after apply)
[0;90m19:01:03.874[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + private_ip                         = (known after apply)
[0;90m19:01:03.875[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + public_ip                          = (known after apply)
[0;90m19:01:03.875[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + secondary_private_ip_address_count = (known after apply)
[0;90m19:01:03.875[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + secondary_private_ip_addresses     = (known after apply)
[0;90m19:01:03.875[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + subnet_id                          = (known after apply)
[0;90m19:01:03.875[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags                               = {
[0;90m19:01:03.875[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-nat-gw-1"
[0;90m19:01:03.875[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.875[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all                           = {
[0;90m19:01:03.875[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.875[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.875[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.875[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-nat-gw-1"
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_nat_gateway.main[1] will be created
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_nat_gateway" "main" {
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + allocation_id                      = (known after apply)
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + association_id                     = (known after apply)
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + connectivity_type                  = "public"
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                                 = (known after apply)
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + network_interface_id               = (known after apply)
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + private_ip                         = (known after apply)
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + public_ip                          = (known after apply)
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + secondary_private_ip_address_count = (known after apply)
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + secondary_private_ip_addresses     = (known after apply)
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + subnet_id                          = (known after apply)
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags                               = {
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-nat-gw-2"
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all                           = {
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-nat-gw-2"
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.876[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route.private_app_nat[0] will be created
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route" "private_app_nat" {
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + destination_cidr_block = "0.0.0.0/0"
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                     = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + instance_id            = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + instance_owner_id      = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + nat_gateway_id         = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + network_interface_id   = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + origin                 = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route_table_id         = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + state                  = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route.private_app_nat[1] will be created
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route" "private_app_nat" {
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + destination_cidr_block = "0.0.0.0/0"
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                     = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + instance_id            = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + instance_owner_id      = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + nat_gateway_id         = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + network_interface_id   = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + origin                 = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route_table_id         = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + state                  = (known after apply)
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route.private_data_nat[0] will be created
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route" "private_data_nat" {
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + destination_cidr_block = "0.0.0.0/0"
[0;90m19:01:03.877[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                     = (known after apply)
[0;90m19:01:03.880[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + instance_id            = (known after apply)
[0;90m19:01:03.880[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + instance_owner_id      = (known after apply)
[0;90m19:01:03.880[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + nat_gateway_id         = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + network_interface_id   = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + origin                 = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route_table_id         = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + state                  = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route.public_internet will be created
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route" "public_internet" {
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + destination_cidr_block = "0.0.0.0/0"
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + gateway_id             = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                     = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + instance_id            = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + instance_owner_id      = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + network_interface_id   = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + origin                 = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route_table_id         = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + state                  = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route_table.private_app[0] will be created
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route_table" "private_app" {
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn              = (known after apply)
[0;90m19:01:03.883[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id               = (known after apply)
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + owner_id         = (known after apply)
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + propagating_vgws = (known after apply)
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route            = (known after apply)
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags             = {
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-private-app-rt-us-east-1a"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all         = {
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-private-app-rt-us-east-1a"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc_id           = (known after apply)
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route_table.private_app[1] will be created
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route_table" "private_app" {
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn              = (known after apply)
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id               = (known after apply)
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + owner_id         = (known after apply)
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + propagating_vgws = (known after apply)
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route            = (known after apply)
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags             = {
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-private-app-rt-us-east-1b"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all         = {
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-private-app-rt-us-east-1b"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc_id           = (known after apply)
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.884[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route_table.private_data will be created
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route_table" "private_data" {
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn              = (known after apply)
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id               = (known after apply)
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + owner_id         = (known after apply)
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + propagating_vgws = (known after apply)
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route            = (known after apply)
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags             = {
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-private-data-rt"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all         = {
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-private-data-rt"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc_id           = (known after apply)
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route_table.public will be created
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route_table" "public" {
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn              = (known after apply)
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id               = (known after apply)
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + owner_id         = (known after apply)
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + propagating_vgws = (known after apply)
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route            = (known after apply)
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags             = {
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-public-rt"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all         = {
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-public-rt"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.885[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.886[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.886[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc_id           = (known after apply)
[0;90m19:01:03.886[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.886[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route_table_association.private_app[0] will be created
[0;90m19:01:03.886[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route_table_association" "private_app" {
[0;90m19:01:03.886[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id             = (known after apply)
[0;90m19:01:03.886[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route_table_id = (known after apply)
[0;90m19:01:03.886[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + subnet_id      = (known after apply)
[0;90m19:01:03.886[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.886[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route_table_association.private_app[1] will be created
[0;90m19:01:03.886[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route_table_association" "private_app" {
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id             = (known after apply)
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route_table_id = (known after apply)
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + subnet_id      = (known after apply)
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route_table_association.private_data[0] will be created
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route_table_association" "private_data" {
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id             = (known after apply)
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route_table_id = (known after apply)
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + subnet_id      = (known after apply)
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route_table_association.private_data[1] will be created
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route_table_association" "private_data" {
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id             = (known after apply)
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route_table_id = (known after apply)
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + subnet_id      = (known after apply)
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route_table_association.public[0] will be created
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route_table_association" "public" {
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id             = (known after apply)
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route_table_id = (known after apply)
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + subnet_id      = (known after apply)
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_route_table_association.public[1] will be created
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_route_table_association" "public" {
[0;90m19:01:03.889[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id             = (known after apply)
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + route_table_id = (known after apply)
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + subnet_id      = (known after apply)
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_subnet.private_app[0] will be created
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_subnet" "private_app" {
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn                                            = (known after apply)
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + assign_ipv6_address_on_creation                = false
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + availability_zone                              = "us-east-1a"
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + availability_zone_id                           = (known after apply)
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + cidr_block                                     = "10.0.16.0/20"
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_dns64                                   = false
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_resource_name_dns_a_record_on_launch    = false
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_resource_name_dns_aaaa_record_on_launch = false
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                                             = (known after apply)
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_native                                    = false
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + map_public_ip_on_launch                        = false
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + owner_id                                       = (known after apply)
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + private_dns_hostname_type_on_launch            = (known after apply)
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags                                           = {
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-private-app-us-east-1a"
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Tier" = "private-app"
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all                                       = {
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-private-app-us-east-1a"
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Tier"        = "private-app"
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.890[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc_id                                         = (known after apply)
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_subnet.private_app[1] will be created
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_subnet" "private_app" {
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn                                            = (known after apply)
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + assign_ipv6_address_on_creation                = false
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + availability_zone                              = "us-east-1b"
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + availability_zone_id                           = (known after apply)
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + cidr_block                                     = "10.0.32.0/20"
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_dns64                                   = false
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_resource_name_dns_a_record_on_launch    = false
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_resource_name_dns_aaaa_record_on_launch = false
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                                             = (known after apply)
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_native                                    = false
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + map_public_ip_on_launch                        = false
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + owner_id                                       = (known after apply)
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + private_dns_hostname_type_on_launch            = (known after apply)
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags                                           = {
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-private-app-us-east-1b"
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Tier" = "private-app"
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all                                       = {
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-private-app-us-east-1b"
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Tier"        = "private-app"
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc_id                                         = (known after apply)
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_subnet.private_data[0] will be created
[0;90m19:01:03.891[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_subnet" "private_data" {
[0;90m19:01:03.892[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn                                            = (known after apply)
[0;90m19:01:03.892[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + assign_ipv6_address_on_creation                = false
[0;90m19:01:03.892[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + availability_zone                              = "us-east-1a"
[0;90m19:01:03.892[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + availability_zone_id                           = (known after apply)
[0;90m19:01:03.892[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + cidr_block                                     = "10.0.4.0/24"
[0;90m19:01:03.892[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_dns64                                   = false
[0;90m19:01:03.892[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_resource_name_dns_a_record_on_launch    = false
[0;90m19:01:03.892[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_resource_name_dns_aaaa_record_on_launch = false
[0;90m19:01:03.892[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                                             = (known after apply)
[0;90m19:01:03.893[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m19:01:03.893[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_native                                    = false
[0;90m19:01:03.893[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + map_public_ip_on_launch                        = false
[0;90m19:01:03.893[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + owner_id                                       = (known after apply)
[0;90m19:01:03.893[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + private_dns_hostname_type_on_launch            = (known after apply)
[0;90m19:01:03.893[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags                                           = {
[0;90m19:01:03.893[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-private-data-us-east-1a"
[0;90m19:01:03.893[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Tier" = "private-data"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all                                       = {
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-private-data-us-east-1a"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Tier"        = "private-data"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc_id                                         = (known after apply)
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_subnet.private_data[1] will be created
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_subnet" "private_data" {
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn                                            = (known after apply)
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + assign_ipv6_address_on_creation                = false
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + availability_zone                              = "us-east-1b"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + availability_zone_id                           = (known after apply)
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + cidr_block                                     = "10.0.5.0/24"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_dns64                                   = false
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_resource_name_dns_a_record_on_launch    = false
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_resource_name_dns_aaaa_record_on_launch = false
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                                             = (known after apply)
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_native                                    = false
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + map_public_ip_on_launch                        = false
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + owner_id                                       = (known after apply)
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + private_dns_hostname_type_on_launch            = (known after apply)
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags                                           = {
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-private-data-us-east-1b"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Tier" = "private-data"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all                                       = {
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.894[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-private-data-us-east-1b"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Tier"        = "private-data"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc_id                                         = (known after apply)
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_subnet.public[0] will be created
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_subnet" "public" {
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn                                            = (known after apply)
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + assign_ipv6_address_on_creation                = false
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + availability_zone                              = "us-east-1a"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + availability_zone_id                           = (known after apply)
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + cidr_block                                     = "10.0.1.0/24"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_dns64                                   = false
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_resource_name_dns_a_record_on_launch    = false
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_resource_name_dns_aaaa_record_on_launch = false
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                                             = (known after apply)
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_native                                    = false
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + map_public_ip_on_launch                        = true
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + owner_id                                       = (known after apply)
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + private_dns_hostname_type_on_launch            = (known after apply)
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags                                           = {
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-public-us-east-1a"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Tier" = "public"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all                                       = {
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-public-us-east-1a"
[0;90m19:01:03.895[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Tier"        = "public"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc_id                                         = (known after apply)
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_subnet.public[1] will be created
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_subnet" "public" {
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn                                            = (known after apply)
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + assign_ipv6_address_on_creation                = false
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + availability_zone                              = "us-east-1b"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + availability_zone_id                           = (known after apply)
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + cidr_block                                     = "10.0.2.0/24"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_dns64                                   = false
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_resource_name_dns_a_record_on_launch    = false
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_resource_name_dns_aaaa_record_on_launch = false
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                                             = (known after apply)
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_cidr_block_association_id                 = (known after apply)
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_native                                    = false
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + map_public_ip_on_launch                        = true
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + owner_id                                       = (known after apply)
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + private_dns_hostname_type_on_launch            = (known after apply)
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags                                           = {
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-public-us-east-1b"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Tier" = "public"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all                                       = {
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-public-us-east-1b"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.896[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Tier"        = "public"
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + vpc_id                                         = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  # aws_vpc.main will be created
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + resource "aws_vpc" "main" {
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + arn                                  = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + cidr_block                           = "10.0.0.0/16"
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + default_network_acl_id               = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + default_route_table_id               = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + default_security_group_id            = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + dhcp_options_id                      = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_dns_hostnames                 = true
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_dns_support                   = true
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + enable_network_address_usage_metrics = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + id                                   = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + instance_tenancy                     = "default"
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_association_id                  = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_cidr_block                      = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + ipv6_cidr_block_network_border_group = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + main_route_table_id                  = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + owner_id                             = (known after apply)
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags                                 = {
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name" = "production-vpc"
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + tags_all                             = {
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Component"   = "general-networking"
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Name"        = "production-vpc"
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m        }
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    }
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0mPlan: 26 to add, 0 to change, 0 to destroy.
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0mChanges to Outputs:
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + availability_zones          = [
[0;90m19:01:03.897[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + "us-east-1a",
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + "us-east-1b",
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    ]
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + internet_gateway_id         = (known after apply)
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + nat_gateway_ids             = [
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + (known after apply),
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + (known after apply),
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    ]
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + private_app_route_table_ids = [
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + (known after apply),
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + (known after apply),
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    ]
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + private_app_subnet_ids      = [
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + (known after apply),
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + (known after apply),
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    ]
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + private_data_route_table_id = (known after apply)
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + private_data_subnet_ids     = [
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + (known after apply),
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + (known after apply),
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    ]
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + public_route_table_id       = (known after apply)
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + public_subnet_ids           = [
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + (known after apply),
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m      + (known after apply),
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m    ]
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + vpc_cidr                    = "10.0.0.0/16"
[0;90m19:01:03.898[0m [0;37mSTDOUT[0m [0;38;5;66m[us-east-1/general-networking] [0m[0;36mtofu: [0m  + vpc_id                      = (known after apply)
Running Trivy config scan...
2025-10-31T19:01:03Z	INFO	[misconfig] Misconfiguration scanning is enabled
2025-10-31T19:01:03Z	INFO	[misconfig] Need to update the checks bundle
2025-10-31T19:01:03Z	INFO	[misconfig] Downloading the checks bundle...
2025-10-31T19:01:03Z	INFO	[misconfig] Misconfiguration scanning is enabled
2025-10-31T19:01:03Z	INFO	[misconfig] Need to update the checks bundle
2025-10-31T19:01:03Z	INFO	[misconfig] Downloading the checks bundle...
165.46 KiB / 165.46 KiB [------------------------------------------------------] 100.00% ? p/s 100ms165.46 KiB / 165.46 KiB [--------------------------------------------------------->] 100.00% ? p/s ?165.46 KiB / 165.46 KiB [----------------------------------------------] 100.00% 11.22 MiB p/s 200ms2025-10-31T19:01:06Z	INFO	[terraform scanner] Scanning root module	file_path="."
2025-10-31T19:01:06Z	INFO	[terraform scanner] Scanning root module	file_path="."
2025-10-31T19:01:06Z	INFO	Detected config files	num=1

Report Summary

┌────────┬────────────────────────┬───────────────────┐
│ Target │          Type          │ Misconfigurations │
├────────┼────────────────────────┼───────────────────┤
│ .      │ terraformplan-snapshot │         0         │
└────────┴────────────────────────┴───────────────────┘
Legend:
- '-': Not scanned
- '0': Clean (no security findings detected)

Running Checkov...
2025-10-31T19:01:06Z	INFO	[terraform scanner] Scanning root module	file_path="."
2025-10-31T19:01:06Z	INFO	[terraform scanner] Scanning root module	file_path="."
2025-10-31T19:01:06Z	INFO	Detected config files	num=2

Report Summary

┌─────────┬────────────────────────┬───────────────────┐
│ Target  │          Type          │ Misconfigurations │
├─────────┼────────────────────────┼───────────────────┤
│ .       │ terraformplan-snapshot │         0         │
├─────────┼────────────────────────┼───────────────────┤
│ main.tf │ terraformplan-snapshot │         0         │
└─────────┴────────────────────────┴───────────────────┘
Legend:
- '-': Not scanned
- '0': Clean (no security findings detected)

Running Checkov...
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0mOpenTofu used the selected providers to generate the following execution
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0mplan. Resource actions are indicated with the following symbols:
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m  + create
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0mOpenTofu will perform the following actions:
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m  # aws_cloudwatch_log_group.waf[0] will be created
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m  + resource "aws_cloudwatch_log_group" "waf" {
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + arn               = (known after apply)
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + id                = (known after apply)
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + log_group_class   = (known after apply)
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + name              = "/aws/wafv2/production-us-east-1-waf"
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + name_prefix       = (known after apply)
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + retention_in_days = 90
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + skip_destroy      = false
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + tags_all          = {
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + "Component"   = "waf"
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m        }
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m    }
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m  # aws_wafv2_web_acl.this will be created
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m  + resource "aws_wafv2_web_acl" "this" {
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + application_integration_url = (known after apply)
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + arn                         = (known after apply)
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + capacity                    = (known after apply)
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + id                          = (known after apply)
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + lock_token                  = (known after apply)
[0;90m19:01:07.644[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + name                        = "production-us-east-1-waf"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + name_prefix                 = (known after apply)
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + scope                       = "REGIONAL"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + tags                        = {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + "Name" = "production-us-east-1-waf"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m        }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + tags_all                    = {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + "Component"   = "waf"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + "Name"        = "production-us-east-1-waf"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m        }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + default_action {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + allow {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m        }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + rule {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + name     = "RateLimitRule"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + priority = 40
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + action {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + block {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + statement {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + rate_based_statement {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                  + aggregate_key_type    = "IP"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                  + evaluation_window_sec = 300
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                  + limit                 = 2000
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + visibility_config {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + cloudwatch_metrics_enabled = true
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + metric_name                = "production-us-east-1-waf-rate-limit"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + sampled_requests_enabled   = true
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m        }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + rule {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + name     = "AWSManagedRulesAmazonIpReputationList"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + priority = 30
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + override_action {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + none {}
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + statement {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + managed_rule_group_statement {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                  + name        = "AWSManagedRulesAmazonIpReputationList"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                  + vendor_name = "AWS"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + visibility_config {
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + cloudwatch_metrics_enabled = true
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + metric_name                = "production-us-east-1-waf-ip-reputation"
[0;90m19:01:07.645[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + sampled_requests_enabled   = true
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m        }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + rule {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + name     = "AWSManagedRulesCommonRuleSet"
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + priority = 10
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + override_action {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + none {}
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + statement {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + managed_rule_group_statement {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                  + name        = "AWSManagedRulesCommonRuleSet"
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                  + vendor_name = "AWS"
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + visibility_config {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + cloudwatch_metrics_enabled = true
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + metric_name                = "production-us-east-1-waf-common-rules"
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + sampled_requests_enabled   = true
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m        }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + rule {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + priority = 20
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + override_action {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + none {}
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + statement {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + managed_rule_group_statement {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                  + vendor_name = "AWS"
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m                }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + visibility_config {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + cloudwatch_metrics_enabled = true
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + metric_name                = "production-us-east-1-waf-bad-inputs"
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + sampled_requests_enabled   = true
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m        }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + visibility_config {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + cloudwatch_metrics_enabled = true
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + metric_name                = "production-us-east-1-waf"
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + sampled_requests_enabled   = true
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m        }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m    }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m  # aws_wafv2_web_acl_logging_configuration.this[0] will be created
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m  + resource "aws_wafv2_web_acl_logging_configuration" "this" {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + id                      = (known after apply)
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + log_destination_configs = (known after apply)
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + resource_arn            = (known after apply)
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + redacted_fields {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + single_header {
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + name = "authorization"
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m        }
[0;90m19:01:07.646[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m      + redacted_fields {
[0;90m19:01:07.647[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m          + single_header {
[0;90m19:01:07.647[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m              + name = "cookie"
[0;90m19:01:07.647[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m            }
[0;90m19:01:07.647[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m        }
[0;90m19:01:07.647[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m    }
[0;90m19:01:07.647[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0mPlan: 3 to add, 0 to change, 0 to destroy.
[0;90m19:01:07.647[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0mChanges to Outputs:
[0;90m19:01:07.647[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m  + web_acl_arn      = (known after apply)
[0;90m19:01:07.647[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m  + web_acl_capacity = (known after apply)
[0;90m19:01:07.647[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m  + web_acl_id       = (known after apply)
[0;90m19:01:07.647[0m [0;37mSTDOUT[0m [0;38;5;95m[us-east-1/waf] [0m[0;36mtofu: [0m  + web_acl_name     = "production-us-east-1-waf"
Running Trivy config scan...
2025-10-31T19:01:07Z	INFO	[misconfig] Misconfiguration scanning is enabled


---


2025-10-31T19:01:09Z	INFO	[terraform scanner] Scanning root module	file_path="."
2025-10-31T19:01:09Z	INFO	[terraform scanner] Scanning root module	file_path="."
2025-10-31T19:01:09Z	INFO	Detected config files	num=1

Report Summary

┌────────┬────────────────────────┬───────────────────┐
│ Target │          Type          │ Misconfigurations │
├────────┼────────────────────────┼───────────────────┤
│ .      │ terraformplan-snapshot │         0         │
└────────┴────────────────────────┴───────────────────┘
Legend:
- '-': Not scanned
- '0': Clean (no security findings detected)

Running Checkov...


---




---


[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0mOpenTofu used the selected providers to generate the following execution
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0mplan. Resource actions are indicated with the following symbols:
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  + create
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0mOpenTofu will perform the following actions:
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  # aws_iam_instance_profile.this[0] will be created
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  + resource "aws_iam_instance_profile" "this" {
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + arn         = (known after apply)
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + create_date = (known after apply)
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + id          = (known after apply)
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + name        = "production-eks-node"
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + name_prefix = (known after apply)
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + path        = "/"
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + role        = "production-eks-node"
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + tags        = {
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "Name" = "production-eks-node"
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m        }
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + tags_all    = {
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "Component"   = "iam-role-eks-node"
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "Name"        = "production-eks-node"
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:17.035[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m        }
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + unique_id   = (known after apply)
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m    }
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  # aws_iam_role.this will be created
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  + resource "aws_iam_role" "this" {
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + arn                   = (known after apply)
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + assume_role_policy    = jsonencode(
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m            {
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m              + Statement = [
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m                  + {
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m                      + Action    = "sts:AssumeRole"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m                      + Effect    = "Allow"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m                      + Principal = {
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m                          + Service = "ec2.amazonaws.com"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m                        }
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m                    },
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m                ]
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m              + Version   = "2012-10-17"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m            }
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m        )
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + create_date           = (known after apply)
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + description           = "IAM role for EKS worker nodes"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + force_detach_policies = false
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + id                    = (known after apply)
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + managed_policy_arns   = (known after apply)
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + max_session_duration  = 3600
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + name                  = "production-eks-node"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + name_prefix           = (known after apply)
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + path                  = "/"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + tags                  = {
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "Name" = "production-eks-node"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m        }
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + tags_all              = {
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "Component"   = "iam-role-eks-node"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "Name"        = "production-eks-node"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:17.036[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m        }
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + unique_id             = (known after apply)
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + inline_policy (known after apply)
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m    }
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  # aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  + resource "aws_iam_role_policy_attachment" "this" {
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + id         = (known after apply)
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + role       = "production-eks-node"
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m    }
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  # aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  + resource "aws_iam_role_policy_attachment" "this" {
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + id         = (known after apply)
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + role       = "production-eks-node"
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m    }
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  # aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  + resource "aws_iam_role_policy_attachment" "this" {
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + id         = (known after apply)
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + role       = "production-eks-node"
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m    }
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  # aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"] will be created
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  + resource "aws_iam_role_policy_attachment" "this" {
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + id         = (known after apply)
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m      + role       = "production-eks-node"
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m    }
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0mPlan: 6 to add, 0 to change, 0 to destroy.
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0mChanges to Outputs:
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  + instance_profile_arn  = (known after apply)
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  + instance_profile_name = "production-eks-node"
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  + role_arn              = (known after apply)
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  + role_id               = (known after apply)
[0;90m19:01:17.037[0m [0;37mSTDOUT[0m [0;38;5;96m[us-east-1/iam-role-eks-node] [0m[0;36mtofu: [0m  + role_name             = "production-eks-node"
Running Trivy config scan...
2025-10-31T19:01:17Z	INFO	[misconfig] Misconfiguration scanning is enabled
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0mOpenTofu used the selected providers to generate the following execution
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0mplan. Resource actions are indicated with the following symbols:
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m  + create
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0mOpenTofu will perform the following actions:
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m  # aws_iam_role.this will be created
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m  + resource "aws_iam_role" "this" {
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + arn                   = (known after apply)
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + assume_role_policy    = jsonencode(
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m            {
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m              + Statement = [
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m                  + {
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m                      + Action    = "sts:AssumeRole"
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m                      + Effect    = "Allow"
[0;90m19:01:17.236[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m                      + Principal = {
[0;90m19:01:17.237[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m                          + Service = "eks.amazonaws.com"
[0;90m19:01:17.237[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m                        }
[0;90m19:01:17.237[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m                    },
[0;90m19:01:17.237[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m                ]
[0;90m19:01:17.237[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m              + Version   = "2012-10-17"
[0;90m19:01:17.237[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m            }
[0;90m19:01:17.237[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m        )
[0;90m19:01:17.237[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + create_date           = (known after apply)
[0;90m19:01:17.237[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + description           = "IAM role for EKS cluster control plane"
[0;90m19:01:17.237[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + force_detach_policies = false
[0;90m19:01:17.237[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + id                    = (known after apply)
[0;90m19:01:17.237[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + managed_policy_arns   = (known after apply)
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + max_session_duration  = 3600
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + name                  = "production-eks-cluster"
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + name_prefix           = (known after apply)
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + path                  = "/"
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + tags                  = {
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m          + "Name" = "production-eks-cluster"
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m        }
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + tags_all              = {
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m          + "Component"   = "iam-role-eks-cluster"
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m          + "Name"        = "production-eks-cluster"
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m        }
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + unique_id             = (known after apply)
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + inline_policy (known after apply)
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m    }
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m  # aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m  + resource "aws_iam_role_policy_attachment" "this" {
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + id         = (known after apply)
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + role       = "production-eks-cluster"
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m    }
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m  # aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m  + resource "aws_iam_role_policy_attachment" "this" {
[0;90m19:01:17.239[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + id         = (known after apply)
[0;90m19:01:17.240[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
[0;90m19:01:17.240[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m      + role       = "production-eks-cluster"
[0;90m19:01:17.240[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m    }
[0;90m19:01:17.240[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0mPlan: 3 to add, 0 to change, 0 to destroy.
[0;90m19:01:17.240[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0mChanges to Outputs:
[0;90m19:01:17.240[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m  + role_arn              = (known after apply)
[0;90m19:01:17.240[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m  + role_id               = (known after apply)
[0;90m19:01:17.240[0m [0;37mSTDOUT[0m [0;38;5;102m[us-east-1/iam-role-eks-cluster] [0m[0;36mtofu: [0m  + role_name             = "production-eks-cluster"
Running Trivy config scan...
2025-10-31T19:01:17Z	INFO	[misconfig] Misconfiguration scanning is enabled
2025-10-31T19:01:19Z	INFO	[terraform scanner] Scanning root module	file_path="."
2025-10-31T19:01:19Z	INFO	[terraform scanner] Scanning root module	file_path="."
2025-10-31T19:01:19Z	INFO	Detected config files	num=1

Report Summary

┌────────┬────────────────────────┬───────────────────┐
│ Target │          Type          │ Misconfigurations │
├────────┼────────────────────────┼───────────────────┤
│ .      │ terraformplan-snapshot │         0         │
└────────┴────────────────────────┴───────────────────┘
Legend:
- '-': Not scanned
- '0': Clean (no security findings detected)

2025-10-31T19:01:19Z	INFO	[terraform scanner] Scanning root module	file_path="."
Running Checkov...
2025-10-31T19:01:19Z	INFO	[terraform scanner] Scanning root module	file_path="."
2025-10-31T19:01:19Z	INFO	Detected config files	num=1

Report Summary

┌────────┬────────────────────────┬───────────────────┐
│ Target │          Type          │ Misconfigurations │
├────────┼────────────────────────┼───────────────────┤
│ .      │ terraformplan-snapshot │         0         │
└────────┴────────────────────────┴───────────────────┘
Legend:
- '-': Not scanned
- '0': Clean (no security findings detected)

Running Checkov...


---




---


[0;90m19:01:30.428[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0mOpenTofu used the selected providers to generate the following execution
[0;90m19:01:30.428[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0mplan. Resource actions are indicated with the following symbols:
[0;90m19:01:30.428[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m  + create
[0;90m19:01:30.435[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0mOpenTofu will perform the following actions:
[0;90m19:01:30.435[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m  # aws_security_group.this will be created
[0;90m19:01:30.435[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m  + resource "aws_security_group" "this" {
[0;90m19:01:30.435[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + arn                    = (known after apply)
[0;90m19:01:30.435[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + description            = "Security group for EKS cluster control plane"
[0;90m19:01:30.435[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + egress                 = (known after apply)
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + id                     = (known after apply)
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + ingress                = (known after apply)
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + name                   = (known after apply)
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + name_prefix            = "production-eks-cluster-"
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + owner_id               = (known after apply)
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + revoke_rules_on_delete = false
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + tags                   = {
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Name" = "production-eks-cluster"
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m        }
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + tags_all               = {
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Component"   = "security-groups-eks-cluster"
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Name"        = "production-eks-cluster"
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m        }
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + vpc_id                 = "vpc-mock1234567890abc"
[0;90m19:01:30.436[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m    }
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m  # aws_vpc_security_group_egress_rule.this["0"] will be created
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m  + resource "aws_vpc_security_group_egress_rule" "this" {
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + arn                    = (known after apply)
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + cidr_ipv4              = "0.0.0.0/0"
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + description            = "Allow all outbound"
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + from_port              = 0
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + id                     = (known after apply)
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + ip_protocol            = "-1"
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + security_group_id      = (known after apply)
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + security_group_rule_id = (known after apply)
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + tags                   = {}
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + tags_all               = {
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Component"   = "security-groups-eks-cluster"
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:30.437[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m        }
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + to_port                = 0
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m    }
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m  # aws_vpc_security_group_ingress_rule.this["0"] will be created
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m  + resource "aws_vpc_security_group_ingress_rule" "this" {
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + arn                    = (known after apply)
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + cidr_ipv4              = "10.0.0.0/16"
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + description            = "Allow HTTPS from VPC (for kubectl access)"
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + from_port              = 443
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + id                     = (known after apply)
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + ip_protocol            = "tcp"
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + security_group_id      = (known after apply)
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + security_group_rule_id = (known after apply)
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + tags                   = {}
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + tags_all               = {
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Component"   = "security-groups-eks-cluster"
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Environment" = "production"
[0;90m19:01:30.438[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "ManagedBy"   = "Terragrunt"
[0;90m19:01:30.439[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Region"      = "us-east-1"
[0;90m19:01:30.439[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m          + "Terraform"   = "true"
[0;90m19:01:30.439[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m        }
[0;90m19:01:30.439[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m      + to_port                = 443
[0;90m19:01:30.439[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m    }
[0;90m19:01:30.439[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0mPlan: 3 to add, 0 to change, 0 to destroy.
[0;90m19:01:30.439[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0mChanges to Outputs:
[0;90m19:01:30.439[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m  + security_group_arn  = (known after apply)
[0;90m19:01:30.439[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m  + security_group_id   = (known after apply)
[0;90m19:01:30.439[0m [0;37mSTDOUT[0m [0;38;5;108m[us-east-1/security-groups-eks-cluster] [0m[0;36mtofu: [0m  + security_group_name = (known after apply)
Running Trivy config scan...
2025-10-31T19:01:30Z	INFO	[misconfig] Misconfiguration scanning is enabled
[0;90m19:01:31.290[0m [0;37mSTDOUT[0m [0;38;5;103m[us-east-1/alb-target-groups] [0m[0;36mtofu: [0mOpenTofu used the selected providers to generate the following execution
[0;90m19:01:31.290[0m [0;37mSTDOUT[0m [0;38;5;103m[us-east-1/alb-target-groups] [0m[0;36mtofu: [0mplan. Resource actions are indicated with the following symbols:
[0;90m19:01:31.290[0m [0;37mSTDOUT[0m [0;38;5;103m[us-east-1/alb-target-groups] [0m[0;36mtofu: [0m  + create
[0;90m19:01:31.290[0m [0;37mSTDOUT[0m [0;38;5;103m[us-east-1/alb-target-groups] [0m[0;36mtofu: [0mOpenTofu will perform the following actions:
[0;90m19:01:31.290[0m [0;37mSTDOUT[0m [0;38;5;103m[us-east-1/alb-target-groups] [0m[0;36mtofu: [0m  # aws_lb_target_group.this["app"] will be created
[0;90m19:01:31.290[0m [0;37mSTDOUT[0m [0;38;5;103m[us-east-1/alb-target-groups] [0m[0;36mtofu: [0m  + resource "aws_lb_target_group" "this" {
[0;90m19:01:31.291[0m [0;37mSTDOUT[0m [0;38;5;103m[us-east-1/alb-target-groups] [0m[0;36mtofu: [0m      + arn                                = (known after apply)
[0;90m19:01:31.291[0m [0;37mSTDOUT[0m [0;38;5;103m[us-east-1/alb-target-groups] [0m[0;36mtofu: [0m      + arn_suffix                         = (known after apply)
[0;90m19:01:31.291[0m [0;37mSTDOUT[0m [0;38;5;103m[us-east-1/alb-target-groups] [0m[0;36mtofu: [0m      + connection_termination             = (known after apply)
[0;90m19:01:31.291[0m [0;37mSTDOUT[0m [0;38;5;103m[us-east-1/alb-target-groups] [0m[0;36mtofu: [0m      + deregistration_delay               = "30"
[0;90m19:01:31.291[0m [0;37mSTDOUT[0m [0;38;5;103m[us-east-1/alb-target-groups] [0m[0;36mtofu: [0m      + id                                 = (known after apply)
[0;90m19:01:31.291[0m [0;37mSTDOUT[0m [0;38;5;103m[us-east-1/alb-target-groups] [0m[0;36mtofu: [0m      + ip_address_type                    = (kn

[Plan output truncated - download artifacts for full output]
```
</details>

## Cost Estimates

<details><summary>Production</summary>

```
INFO Autodetected 17 Terragrunt projects across 17 root modules
INFO Found Terragrunt project us-east-1-alb at directory us-east-1/alb
INFO Found Terragrunt project us-east-1-alb-listeners at directory us-east-1/alb-listeners
INFO Found Terragrunt project us-east-1-alb-target-groups at directory us-east-1/alb-target-groups
INFO Found Terragrunt project us-east-1-aurora-postgresql at directory us-east-1/aurora-postgresql
INFO Found Terragrunt project us-east-1-eks-cluster at directory us-east-1/eks-cluster
INFO Found Terragrunt project us-east-1-eks-node-group at directory us-east-1/eks-node-group
INFO Found Terragrunt project us-east-1-general-networking at directory us-east-1/general-networking
INFO Found Terragrunt project us-east-1-iam-role-eks-cluster at directory us-east-1/iam-role-eks-cluster
INFO Found Terragrunt project us-east-1-iam-role-eks-node at directory us-east-1/iam-role-eks-node
INFO Found Terragrunt project us-east-1-iam-role-external-secrets at directory us-east-1/iam-role-external-secrets
INFO Found Terragrunt project us-east-1-kms at directory us-east-1/kms
INFO Found Terragrunt project us-east-1-secrets-manager at directory us-east-1/secrets-manager
INFO Found Terragrunt project us-east-1-security-groups-alb at directory us-east-1/security-groups-alb
INFO Found Terragrunt project us-east-1-security-groups-aurora at directory us-east-1/security-groups-aurora
INFO Found Terragrunt project us-east-1-security-groups-eks-cluster at directory us-east-1/security-groups-eks-cluster
INFO Found Terragrunt project us-east-1-security-groups-eks-nodes at directory us-east-1/security-groups-eks-nodes
INFO Found Terragrunt project us-east-1-waf at directory us-east-1/waf
WARN 3 aws_rds_cluster_instance prices missing across 3 resources


Project: us-east-1-alb
Module path: us-east-1/alb

 Name                                Monthly Qty  Unit              Monthly Cost   
                                                                                   
 aws_lb.this                                                                       
 ├─ Application load balancer                730  hours                   $16.43   
 └─ Load balancer capacity units  Monthly cost depends on usage: $5.84 per LCU     
                                                                                   
 Project total                                                            $16.43   

──────────────────────────────────
Project: us-east-1-alb-listeners
Module path: us-east-1/alb-listeners

 Name           Monthly Qty  Unit  Monthly Cost   
                                                  
 Project total                            $0.00   

──────────────────────────────────
Project: us-east-1-alb-target-groups
Module path: us-east-1/alb-target-groups

 Name           Monthly Qty  Unit  Monthly Cost   
                                                  
 Project total                            $0.00   

──────────────────────────────────
Project: us-east-1-aurora-postgresql
Module path: us-east-1/aurora-postgresql

 Name                                                               Monthly Qty  Unit                    Monthly Cost   
                                                                                                                        
 aws_rds_cluster_instance.this[0]                                                                                       
 ├─ Database instance (on-demand, db.r6g.xlarge)                            730  hours                        $378.87   
 ├─ Performance Insights Long Term Retention (db.r6g.xlarge)                  4  vCPU-month                 not found   
 └─ Performance Insights API                                  Monthly cost depends on usage: $0.01 per 1000 requests    
                                                                                                                        
 aws_rds_cluster_instance.this[1]                                                                                       
 ├─ Database instance (on-demand, db.r6g.xlarge)                            730  hours                        $378.87   
 ├─ Performance Insights Long Term Retention (db.r6g.xlarge)                  4  vCPU-month                 not found   
 └─ Performance Insights API                                  Monthly cost depends on usage: $0.01 per 1000 requests    
                                                                                                                        
 aws_rds_cluster_instance.this[2]                                                                                       
 ├─ Database instance (on-demand, db.r6g.xlarge)                            730  hours                        $378.87   
 ├─ Performance Insights Long Term Retention (db.r6g.xlarge)                  4  vCPU-month                 not found   
 └─ Performance Insights API                                  Monthly cost depends on usage: $0.01 per 1000 requests    
                                                                                                                        
 aws_rds_cluster.this                                                                                                   
 ├─ Storage                                                   Monthly cost depends on usage: $0.10 per GB               
 ├─ I/O requests                                              Monthly cost depends on usage: $0.20 per 1M requests      
 ├─ Backup storage                                            Monthly cost depends on usage: $0.021 per GB              
 └─ Snapshot export                                           Monthly cost depends on usage: $0.01 per GB               
                                                                                                                        
 Project total                                                                                              $1,136.61   

──────────────────────────────────
Project: us-east-1-eks-cluster
Module path: us-east-1/eks-cluster

 Name                                       Monthly Qty  Unit                    Monthly Cost   
                                                                                                
 aws_eks_cluster.this                                                                           
 └─ EKS cluster                                     730  hours                         $73.00   
                                                                                                
 aws_kms_key.eks_secrets[0]                                                                     
 ├─ Customer master key                               1  months                         $1.00   
 ├─ Requests                          Monthly cost depends on usage: $0.03 per 10k requests     
 ├─ ECC GenerateDataKeyPair requests  Monthly cost depends on usage: $0.10 per 10k requests     
 └─ RSA GenerateDataKeyPair requests  Monthly cost depends on usage: $0.10 per 10k requests     
                                                                                                
 aws_cloudwatch_log_group.cluster                                                               
 ├─ Data ingested                     Monthly cost depends on usage: $0.50 per GB               
 ├─ Archival Storage                  Monthly cost depends on usage: $0.03 per GB               
 └─ Insights queries data scanned     Monthly cost depends on usage: $0.005 per GB              
                                                                                                
 Project total                                                                         $74.00   

──────────────────────────────────
Project: us-east-1-eks-node-group
Module path: us-east-1/eks-node-group

 Name                                                     Monthly Qty  Unit   Monthly Cost   
                                                                                             
 aws_eks_node_group.this                                                                     
 └─ aws_launch_template.node                                                                 
    ├─ Instance usage (Linux/UNIX, on-demand, t3.medium)        1,460  hours        $60.74   
    └─ block_device_mapping[0]                                                               
       └─ Storage (general purpose SSD, gp3)                      100  GB            $8.00   
                                                                                             
 Project total                                                                      $68.74   

──────────────────────────────────
Project: us-east-1-general-networking
Module path: us-east-1/general-networking

 Name                        Monthly Qty  Unit              Monthly Cost   
                                                                           
 aws_nat_gateway.main[0]                                                   
 ├─ NAT gateway                      730  hours                   $32.85   
 └─ Data processed        Monthly cost depends on usage: $0.045 per GB     
                                                                           
 aws_nat_gateway.main[1]                                                   
 ├─ NAT gateway                      730  hours                   $32.85   
 └─ Data processed        Monthly cost depends on usage: $0.045 per GB     
                                                                           
 Project total                                                    $65.70   

──────────────────────────────────
Project: us-east-1-iam-role-eks-cluster
Module path: us-east-1/iam-role-eks-cluster

 Name           Monthly Qty  Unit  Monthly Cost   
                                                  
 Project total                            $0.00   

──────────────────────────────────
Project: us-east-1-iam-role-eks-node
Module path: us-east-1/iam-role-
```
</details>

<details><summary>Staging</summary>

```
INFO Autodetected 16 Terragrunt projects across 16 root modules
INFO Found Terragrunt project us-east-1-alb at directory us-east-1/alb
INFO Found Terragrunt project us-east-1-alb-listeners at directory us-east-1/alb-listeners
INFO Found Terragrunt project us-east-1-alb-target-groups at directory us-east-1/alb-target-groups
INFO Found Terragrunt project us-east-1-aurora-postgresql at directory us-east-1/aurora-postgresql
INFO Found Terragrunt project us-east-1-eks-cluster at directory us-east-1/eks-cluster
INFO Found Terragrunt project us-east-1-eks-node-group at directory us-east-1/eks-node-group
INFO Found Terragrunt project us-east-1-general-networking at directory us-east-1/general-networking
INFO Found Terragrunt project us-east-1-iam-role-eks-cluster at directory us-east-1/iam-role-eks-cluster
INFO Found Terragrunt project us-east-1-iam-role-eks-node at directory us-east-1/iam-role-eks-node
INFO Found Terragrunt project us-east-1-kms at directory us-east-1/kms
INFO Found Terragrunt project us-east-1-secrets-manager at directory us-east-1/secrets-manager
INFO Found Terragrunt project us-east-1-security-groups-alb at directory us-east-1/security-groups-alb
INFO Found Terragrunt project us-east-1-security-groups-aurora at directory us-east-1/security-groups-aurora
INFO Found Terragrunt project us-east-1-security-groups-eks-cluster at directory us-east-1/security-groups-eks-cluster
INFO Found Terragrunt project us-east-1-security-groups-eks-nodes at directory us-east-1/security-groups-eks-nodes
INFO Found Terragrunt project us-east-1-waf at directory us-east-1/waf



Project: us-east-1-alb
Module path: us-east-1/alb

 Name                                Monthly Qty  Unit              Monthly Cost   
                                                                                   
 aws_lb.this                                                                       
 ├─ Application load balancer                730  hours                   $16.43   
 └─ Load balancer capacity units  Monthly cost depends on usage: $5.84 per LCU     
                                                                                   
 Project total                                                            $16.43   

──────────────────────────────────
Project: us-east-1-alb-listeners
Module path: us-east-1/alb-listeners

 Name           Monthly Qty  Unit  Monthly Cost   
                                                  
 Project total                            $0.00   

──────────────────────────────────
Project: us-east-1-alb-target-groups
Module path: us-east-1/alb-target-groups

 Name           Monthly Qty  Unit  Monthly Cost   
                                                  
 Project total                            $0.00   

──────────────────────────────────
Project: afreidah/helium-challenge/staging/us-east-1/aurora-postgresql
Module path: us-east-1/aurora-postgresql

Errors:
  Error processing module at '/workspace/staging/us-east-1/aurora-postgresql/terragrunt.hcl'. How this module was found:
    Terragrunt config file found in a subdirectory of us-east-1/aurora-postgresql. Underlying error:
      Error reading file at path /workspace/_env_helpers/aurora-test-exact-copy.hcl:
        open /workspace/_env_helpers/aurora-test-exact-copy.hcl:
          no such file or directory

──────────────────────────────────
Project: us-east-1-eks-cluster
Module path: us-east-1/eks-cluster

 Name                                       Monthly Qty  Unit                    Monthly Cost   
                                                                                                
 aws_eks_cluster.this                                                                           
 └─ EKS cluster                                     730  hours                         $73.00   
                                                                                                
 aws_kms_key.eks_secrets[0]                                                                     
 ├─ Customer master key                               1  months                         $1.00   
 ├─ Requests                          Monthly cost depends on usage: $0.03 per 10k requests     
 ├─ ECC GenerateDataKeyPair requests  Monthly cost depends on usage: $0.10 per 10k requests     
 └─ RSA GenerateDataKeyPair requests  Monthly cost depends on usage: $0.10 per 10k requests     
                                                                                                
 aws_cloudwatch_log_group.cluster                                                               
 ├─ Data ingested                     Monthly cost depends on usage: $0.50 per GB               
 ├─ Archival Storage                  Monthly cost depends on usage: $0.03 per GB               
 └─ Insights queries data scanned     Monthly cost depends on usage: $0.005 per GB              
                                                                                                
 Project total                                                                         $74.00   

──────────────────────────────────
Project: us-east-1-eks-node-group
Module path: us-east-1/eks-node-group

 Name                                                     Monthly Qty  Unit   Monthly Cost   
                                                                                             
 aws_eks_node_group.this                                                                     
 └─ aws_launch_template.node                                                                 
    ├─ Instance usage (Linux/UNIX, on-demand, t3.medium)        1,460  hours        $60.74   
    └─ block_device_mapping[0]                                                               
       └─ Storage (general purpose SSD, gp3)                      100  GB            $8.00   
                                                                                             
 Project total                                                                      $68.74   

──────────────────────────────────
Project: us-east-1-general-networking
Module path: us-east-1/general-networking

 Name                        Monthly Qty  Unit              Monthly Cost   
                                                                           
 aws_nat_gateway.main[0]                                                   
 ├─ NAT gateway                      730  hours                   $32.85   
 └─ Data processed        Monthly cost depends on usage: $0.045 per GB     
                                                                           
 aws_nat_gateway.main[1]                                                   
 ├─ NAT gateway                      730  hours                   $32.85   
 └─ Data processed        Monthly cost depends on usage: $0.045 per GB     
                                                                           
 Project total                                                    $65.70   

──────────────────────────────────
Project: us-east-1-iam-role-eks-cluster
Module path: us-east-1/iam-role-eks-cluster

 Name           Monthly Qty  Unit  Monthly Cost   
                                                  
 Project total                            $0.00   

──────────────────────────────────
Project: us-east-1-iam-role-eks-node
Module path: us-east-1/iam-role-eks-node

 Name           Monthly Qty  Unit  Monthly Cost   
                                                  
 Project total                            $0.00   

──────────────────────────────────
Project: us-east-1-kms
Module path: us-east-1/kms

 Name                                       Monthly Qty  Unit                    Monthly Cost   
                                                                                                
 aws_kms_key.this                                                                               
 ├─ Customer master key                               1  months                         $1.00   
 ├─ Requests                          Monthly cost depends on usage: $0.03 per 10k requests     
 ├─ ECC GenerateDataKeyPair requests  Monthly cost depends on usage: $0.10 per 10k requests     
 └─ RSA GenerateDataKeyPair requests  Monthly cost depends on usage: $0.10 per 10k requests     
                                                                                                
 Project total                                                                          $1.00   

──────────────────────────────────
Project: afreidah/helium-challenge/staging/us-east-1/secrets-manager
Module path: us-east-1/secrets-manager

Errors:
  Error processing module at '/workspace/staging/us-east-1/aurora-postgresql/terragrunt.hcl'. How this module was found:
    dependency of module at '/workspace/staging/us-east-1/secrets-manager'. Underlying error:
      Error reading file at path /workspace/_env_helpers/aurora-test-exact-copy.hcl:
        open /workspace/_env_helpers/aurora-test-exact-copy.hcl:
          no such file or directory

──────────────────────────────────
Project: us-east-1-security-groups-alb
Module path: us-east-1/security-groups-alb

 Name           Monthly Qty  Unit  Monthly Cost   
                                                  
 Project total                            $0.00   

──────────────────────────────────
Project: us-east-1-security-groups-aurora
Module path: us-east-1/security-groups-aurora

 Name           Monthly Qty  Unit  Monthly Cost   
                                                  
 Project total                            $0.00   

──────────────────────────────────
Project: us-east-1-security-groups-eks-cluster
Module path: us-east-1/security-groups-eks-cluster

 Name           Monthly Qty  Unit  Monthly Cost   
                                                  
 Project total                            $0.00   

──────────────────────────────────
Project: us-east-1-security-groups-eks-nodes
Module path: us-east-1/security-groups
```
</details>

---
[Download full artifacts](https://github.com/afreidah/helium-challenge/actions/runs/18982435135)